In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1,3,4, np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101',periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.472246 -0.555362 -1.636960  0.287524
2013-01-02 -0.412438 -0.900977 -0.947121  1.597479
2013-01-03 -0.531105  0.493044  1.068696 -0.330102
2013-01-04  0.245967 -0.211568 -1.449977  1.992956
2013-01-05  0.477261 -0.249786  0.740129 -0.319022
2013-01-06  1.184756 -0.580789 -1.119511  0.489403

In [10]:
df2 = pd.DataFrame(
    {
        "A" : 1.0,
        "B" : pd.Timestamp("20130102"),
        "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
        "D" : np.array([3] * 4, dtype="int32"),
        "E" : pd.Categorical(["test", "train", "test", "train"]),
        "F" : "foo"
        
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [14]:
df.head()

                   A         B         C         D
2013-01-01  0.472246 -0.555362 -1.636960  0.287524
2013-01-02 -0.412438 -0.900977 -0.947121  1.597479
2013-01-03 -0.531105  0.493044  1.068696 -0.330102
2013-01-04  0.245967 -0.211568 -1.449977  1.992956
2013-01-05  0.477261 -0.249786  0.740129 -0.319022

In [15]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.245967 -0.211568 -1.449977  1.992956
2013-01-05  0.477261 -0.249786  0.740129 -0.319022
2013-01-06  1.184756 -0.580789 -1.119511  0.489403

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.to_numpy()

array([[ 0.47224606, -0.55536238, -1.63695954,  0.28752358],
       [-0.41243833, -0.9009766 , -0.94712059,  1.59747931],
       [-0.53110548,  0.49304359,  1.06869567, -0.33010198],
       [ 0.24596739, -0.21156778, -1.44997673,  1.99295628],
       [ 0.47726096, -0.24978606,  0.74012923, -0.31902176],
       [ 1.18475629, -0.58078934, -1.11951121,  0.48940268]])

In [21]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [24]:
#show a quick statistic summary of your data:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.239448 -0.334240 -0.557457  0.619706
std    0.636099  0.476959  1.162563  0.974939
min   -0.531105 -0.900977 -1.636960 -0.330102
25%   -0.247837 -0.574433 -1.367360 -0.167385
50%    0.359107 -0.402574 -1.033316  0.388463
75%    0.476007 -0.221122  0.318317  1.320460
max    1.184756  0.493044  1.068696  1.992956

In [25]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.472246   -0.412438   -0.531105    0.245967    0.477261    1.184756
B   -0.555362   -0.900977    0.493044   -0.211568   -0.249786   -0.580789
C   -1.636960   -0.947121    1.068696   -1.449977    0.740129   -1.119511
D    0.287524    1.597479   -0.330102    1.992956   -0.319022    0.489403

In [26]:
# axis로 정렬
df.sort_index(axis = 1, ascending=False)

                   D         C         B         A
2013-01-01  0.287524 -1.636960 -0.555362  0.472246
2013-01-02  1.597479 -0.947121 -0.900977 -0.412438
2013-01-03 -0.330102  1.068696  0.493044 -0.531105
2013-01-04  1.992956 -1.449977 -0.211568  0.245967
2013-01-05 -0.319022  0.740129 -0.249786  0.477261
2013-01-06  0.489403 -1.119511 -0.580789  1.184756

In [27]:
# value로 정렬
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.412438 -0.900977 -0.947121  1.597479
2013-01-06  1.184756 -0.580789 -1.119511  0.489403
2013-01-01  0.472246 -0.555362 -1.636960  0.287524
2013-01-05  0.477261 -0.249786  0.740129 -0.319022
2013-01-04  0.245967 -0.211568 -1.449977  1.992956
2013-01-03 -0.531105  0.493044  1.068696 -0.330102